SunCity/src/Documents/ЧекКоррекции/ЧекКоррекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЧекКоррекции</name>
  <registerRecords>AccumulationRegister.ПродажиПоДисконтнымКартам</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиПоПлатежнымКартам</registerRecords>
  <attributes>
    <name>АдресМагазина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРасчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЧекККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыручкаНаличными</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКоррекции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеФискальнойОперацииБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасчетов</name>
    <type>
      <types>DefinedType.ОснованиеФискальнойОперацииБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйРеквизит</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КассирИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРасчетов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеприменениеККТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПредписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОперацияСДенежнымиСредствами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеКоррекции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПокупательEmail</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПокупательИНН</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПокупательНомер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакАгента</name>
    <type>
      <types>EnumRef.ПризнакиАгента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПробитЧек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКоррекции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасчета</name>
    <type>
      <types>EnumRef.ТипыРасчетаДенежнымиСредствами</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСторно</name>
    <comment>Признак сторнирующего документа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПозицииЧека</name>
    <attributes>
      <name>ГлобальныйИдентификаторТорговойЕдиницы</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПоставщикаИНН</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПоставщикаНаименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПоставщикаТелефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененияСостояния</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодКонтрольнойМарки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтраныПроисхожденияТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТоварнойНоменклатуры</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольныйИдентификационныйЗнак</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредметаРасчета</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТаможеннойДекларации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОператорПереводаАдрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОператорПереводаИНН</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОператорПереводаНаименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОператорПереводаТелефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОператорПоПриемуПлатежейТелефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлатежныйАгентОперация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлатежныйАгентТелефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакАгентаПоПредметуРасчета</name>
      <type>
        <types>EnumRef.ПризнакиАгента</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакПредметаРасчета</name>
      <type>
        <types>EnumRef.ПризнакиПредметаРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакСпособаРасчета</name>
      <type>
        <types>EnumRef.ПризнакиСпособаРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСоСкидками</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипМаркировки</name>
      <type>
        <types>EnumRef.ТипыМаркировкиККТ</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидками</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодBase64</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МераКоличества</name>
      <type>
        <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>CatalogRef.ВидыОплатЧекаККМ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>EnumRef.ТипыОплатыККТ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <type>
        <types>CatalogRef.ЭквайринговыеТерминалы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/InformationRegisters/СкорректированныеФискальныеОперации/СкорректированныеФискальныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкорректированныеФискальныеОперации</name>
  <attributes>
    <name>ПредставлениеКорректирующегоДокумента</name>
    <comment>Хранит представление документ создавшего корректировка. Используется для корректного вывода сообщений пользователю использующих обмен с отбором по магазинам.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкорректированныеДокумент</name>
    <type>
      <types>DefinedType.ОснованиеФискальнойОперацииБПО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/Enums/ТипыПодключаемогоОборудования/ТипыПодключаемогоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПодключаемогоОборудования</name>
  <enumValues>
    <name>СканерШтрихкода</name>
    <comment>Scanner</comment>
  </enumValues>
  <enumValues>
    <name>СчитывательМагнитныхКарт</name>
    <comment>MSR</comment>
  </enumValues>
  <enumValues>
    <name>ККТ</name>
    <comment>KKT</comment>
  </enumValues>
  <enumValues>
    <name>ФискальныйРегистратор</name>
    <comment>FiscalPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЧеков</name>
    <comment>ReceiptPrinter</comment>
  </enumValues>
  <enumValues>
    <name>ДисплейПокупателя</name>
    <comment>LineDisplay</comment>
  </enumValues>
  <enumValues>
    <name>ТерминалСбораДанных</name>
    <comment>DataCollectionTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭквайринговыйТерминал</name>
    <comment>AcquiringTerminal</comment>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеВесы</name>
    <comment>Scale</comment>
  </enumValues>
  <enumValues>
    <name>ВесыСПечатьюЭтикеток</name>
    <comment>ScaleOffline</comment>
  </enumValues>
  <enumValues>
    <name>ККМОфлайн</name>
    <comment>ECROffline</comment>
  </enumValues>
  <enumValues>
    <name>ПринтерЭтикеток</name>
    <comment>LabelPrinter</comment>
  </enumValues>
  <enumValues>
    <name>УстройствоРаспознавания</name>
  </enumValues>
  <enumValues>
    <name>СчитывательRFID</name>
    <comment>RFID</comment>
  </enumValues>
  <enumValues>
    <name>ОблачнаяККТ</name>
  </enumValues>
  <enumValues>
    <name>УдалитьWebСервисОборудование</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Documents/ЧекКоррекции/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	ОбщегоНазначенияРТ.ПроверитьИспользованиеОрганизации(,,Организация);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если НачалоДня(Дата) <> НачалоДня(ТекущаяДатаСеанса()) Тогда
		ТекстОшибки = НСтр("ru = 'Не допускается коррекция датой, отличной от текущей'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Дата",, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КассаККМ)  Тогда
		
		СтруктураСостояниеКассовойСмены = РозничныеПродажиСервер.ПолучитьСостояниеКассовойСмены(КассаККМ);
		
		КассоваяСмена = СтруктураСостояниеКассовойСмены.КассоваяСмена;
		
		ТекстОшибки = НСтр("ru = 'Кассовая смена не открыта'");
		Если НЕ РозничныеПродажиСервер.СменаОткрыта(КассоваяСмена, Дата, ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "КассаККМ",, Отказ);
		КонецЕсли;
		
		ТипОборудования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КассаККМ, "ПодключаемоеОборудование.ТипОборудования");
		Если ТипОборудования <> Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			ТекстОшибки = НСтр("ru = 'Коррекция допускается только при использовании ККТ'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "КассаККМ",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Оплата.Итог("Сумма") < ПозицииЧека.Итог("СуммаСоСкидками") Тогда
		ТекстОшибки = НСтр("ru = 'Сумма оплат меньше итоговой суммы по позициям чека'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Оплата",, Отказ);
	КонецЕсли;
	
	ПродажиСервер.ПроверитьСистемуНалогообложения(ЭтотОбъект, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПробитЧекПоСсылке = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПробитЧек");
	
	Если ПробитЧекПоСсылке = Истина Тогда
		Текст = НСтр("ru = 'Чек коррекции пробит. Операции над этим документом запрещены'");
		ОбщегоНазначения.СообщитьПользователю(Текст,ЭтотОбъект,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Если чек пробит, тогда в любом случае вносим данные в РС СкорректированныеФискальныеОперации
	// независимо от проведения. Данные после пробития не редактируются.
	Если ПробитЧек И НЕ НеприменениеККТ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкорректированныеФискальныеОперации.СкорректированныеДокумент КАК СкорректированныеДокумент
		|ИЗ
		|	РегистрСведений.СкорректированныеФискальныеОперации КАК СкорректированныеФискальныеОперации
		|ГДЕ
		|	СкорректированныеФискальныеОперации.СкорректированныеДокумент = &СкорректированныеДокумент";
		
		Запрос.УстановитьПараметр("СкорректированныеДокумент", ДокументОснование);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			Менеджер = РегистрыСведений.СкорректированныеФискальныеОперации.СоздатьМенеджерЗаписи();
			
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Магазин", ДокументОснование.Метаданные()) Тогда
				Менеджер.Магазин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Магазин");
			Иначе
				Менеджер.Магазин = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "КассаККМ.Магазин");
			КонецЕсли;
			
			Менеджер.СкорректированныеДокумент 				= ДокументОснование;
			Менеджер.ПредставлениеКорректирующегоДокумента 	= Строка(ЭтотОбъект);
			
			Менеджер.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	ИспользуетсяКомиссионнаяТорговля = ДополнительныеСвойства.ИспользуетсяКомиссионнаяТорговля;
	ИспользуетсяУчетИмпортныхТоваров = ДополнительныеСвойства.ИспользуетсяУчетИмпортныхТоваров;
	
	Документы.ЧекКоррекции.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПродажиСервер.ОтразитьПродажи(ДополнительныеСвойства, Движения, Отказ);
	ПродажиСервер.ОтразитьПродажиПоДисконтнымКартам(ДополнительныеСвойства, Движения, Отказ);
	ПродажиСервер.ОтразитьПродажиПоПлатежнымКартам(ДополнительныеСвойства, Движения, Отказ);
	
	ДенежныеСредстваСервер.ОтразитьДенежныеСредстваККМ(ДополнительныеСвойства, Движения, Отказ);
	ДенежныеСредстваСервер.ОтразитьРасчетыСКлиентами(ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьСписокРегистровДляКонтроля(ДополнительныеСвойства);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ОбъектКопирования.НеприменениеККТ Тогда
		
		Текст = НСтр("ru = 'Можно копировать документы только с признаком ""Неприменение ККТ""'");
		
		ВызватьИсключение(Текст);
		
	КонецЕсли;
	
	НомерСмены = 0;
	НомерЧека  = 0;
	ПробитЧек = Ложь;
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)

	Ответственный = Пользователи.ТекущийПользователь();
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("КассирНаименование", "ФизическоеЛицо.Наименование");
	СтруктураРеквизитов.Вставить("КассирИНН", "ФизическоеЛицо.ИНН");
	РеквизитыКассира = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ответственный, СтруктураРеквизитов);
	
	Кассир 		= РеквизитыКассира.КассирНаименование;
	КассирИНН 	= РеквизитыКассира.КассирИНН;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.Свойство("КассаККМ") Тогда
			КассаККМ      = ДанныеЗаполнения.КассаККМ;
			Магазин       = КассаККМ.Магазин;
			Организация   = КассаККМ.Владелец;
		Иначе
			ЗаполнитьЗначенияПоУмолчанию();
		КонецЕсли;
		
	Иначе
		
		ЗаполнитьЗначенияПоУмолчанию();
		
	КонецЕсли;
	
	НеприменениеККТ = Истина;
	ОписаниеКоррекции = НСтр("ru = 'Неприменение ККТ'");
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	Магазин       = ЗначениеНастроекПовтИсп.МагазинПоУмолчанию(Магазин);
	Организация   = ЗначениеНастроекПовтИсп.ОрганизацияПоУмолчанию(Организация, Ответственный);
	КассаККМ      = ЗначениеНастроекПовтИсп.КассаККМПоУмолчанию(Организация, Магазин, КассаККМ, Ответственный);
	
КонецПроцедуры

Процедура СформироватьСписокРегистровДляКонтроля(ДополнительныеСвойства)

	Массив = Новый Массив;
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И НЕ ДополнительныеСвойства.Свойство("ЗагрузкаДанныхИзРабочегоМеста") Тогда
		
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
